app/controllers/cars_controller.rb

INSERT INTO "cars" ("user_id", "car_approved", "niv", "make", "model", "year", "engine", "transmission", "gas_type", "doors", "seats", "price", "unlimited_distance", "extra_km_price", "description", "max_distance", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18) RETURNING "id"
---
  def create
    @car = Car.new(car_params)
    @car.owner = current_user
    if @car.save